<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Dominosa</title>
<link rel="previous" href="pegs.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="untangle.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="pegs.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="untangle.html">Next</a></p>
<h1><a name="C17"></a>Chapter 17: <a name="i0"></a>Dominosa</h1>
<p>
Ein normaler Satz Dominos &#8211; d.h. jedes (ungeordnete) Paar von Zahlen von 0 bis 6 ist einmal vorhanden &#8211; wurde unregelm&#228;&#223;ig auf ein Rechteck arrangiert; dann wurde die Zahl in jedem Quadrat notiert und die Dominos selbst wurden entfernt. Ihre Aufgabe besteht darin, das Muster zu rekonstruieren, indem Sie den Satz an Dominos so arrangieren, dass Sie zu dem vorgegebenen Zahlenraster passen.
</p>
<p>
Dieses Puzzle wird h&#228;ufig O. S. Adler zugeschrieben und erh&#228;lt einen Teil seines Namens aus diesen Initialen.
</p>
<h2><a name="S17.1"></a>17.1 <a name="i1"></a>Dominosa-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Klicken mit der linken Maustaste zwischen zwei benachbarten Zahlen positioniert einen Domino, der beide bedeckt oder entfernt diesen, falls er bereits vorhanden ist. Wird versucht, einen Domino zu positionieren, der existierende Dominos &#252;berlappt, so werden die &#252;berlappten Dominos entfernt.
</p>
<p>
Durch Klicken mit der rechten Maustaste zwischen zwei benachbarte Zahlen wird eine Linie zwischen ihnen gezogen, die Sie dazu verwenden k&#246;nnen, sich daran zu erinnern, dass diese zwei Zahlen <em>nicht</em> von einem einzelnen Domino &#252;berdeckt werden. Durch erneutes Klicken mit der rechten Maustaste wird die Linie wieder entfernt.
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um den Cursor durch das Gitter zu bewegen. Wenn der Cursor in der Mitte zwischen zwei benachbarten Zahlen ist, wird durch Dr&#252;cken der Eingabetaste ein Domino platziert, der diese zwei Zahlen abdeckt. Wird stattdessen die Leertaste gedr&#252;ckt, wird eine Linie zwischen den zwei Quadraten eingef&#252;gt. Durch Wiederholung einer der beiden Aktionen wird der Domino oder die Linie wieder entfernt.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S17.2"></a>17.2 <a name="i2"></a>Dominosa-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Maximum number on dominoes</em>
</dt>
<dd>
Steuert die Gr&#246;&#223;e des Puzzles, indem es die Gr&#246;&#223;e der Menge von hierzu verwandten Dominos steuert. Dominos mit Zahlen bis N ergeben ein (N+2) &#215; (N+1)-Rechteck, damit ergibt der Vorgabewert von 6 ein 8&#215;7-Gitter.
</dd>
<dt>
<em>Ensure unique solution</em>
</dt>
<dd>
Normalerweise stellt Dominosa sicher, dass die vorgestellten Puzzle nur eine L&#246;sung haben. Puzzle mit mehrdeutigen Abschnitten k&#246;nnen schwieriger und manchmal subtiler sein, falls Sie dies m&#246;gen, k&#246;nnen Sie daher diese Funktion abstellen. Auch kann das Finden <em>aller</em> m&#246;glicher L&#246;sungen eine zus&#228;tzliche Herausforderung f&#252;r den fortgeschrittenen Spieler darstellen. Abschalten dieser Option kann auch die Puzzleerstellung beschleunigen.
</dd>
</dl>

<hr><address></address></body>
</html>
