<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Filling</title>
<link rel="previous" href="galaxies.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="keen.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="galaxies.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="keen.html">Next</a></p>
<h1><a name="C29"></a>Chapter 29: <a name="i0"></a>Filling</h1>
<p>
Sie bekommen ein Gitter an Quadraten, von denen einige Ziffern enthalten und der Rest leer ist. Ihre Aufgabe besteht darin, Ziffern in die leeren Quadrate dergestalt einzuf&#252;gen, dass jede zusammenh&#228;ngende Region an Quadraten, die die gleiche Ziffer enthalten, ein Fl&#228;che abdeckt, die der Ziffer entspricht.
</p>
<p>
(F&#252;r die Zwecke dieses Spiels z&#228;hlen diagonal getrennte Quadrate bei den &#8216;verbundenen Regionen&#8217; nicht als benachbart.)
</p>
<p>
Daraus folgt beispielsweise, dass kein Quadrat eine Null enthalten kann und zwei benachbarte Quadrate keine Eins. Keine Region hat ein Gebiet gr&#246;&#223;er als 9 (da dann sein Gebiet nicht eine einzelne Ziffer w&#228;re).
</p>
<p>
Dank f&#252;r dieses Puzzle geht an <a name="i1"></a>Nikoli <a href="#p0">[14]</a>.
</p>
<p>
Filling wurde von Jonas K&#246;lker zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[14] <a href="http://www.nikoli.co.jp/en/puzzles/fillomino/"><code>http://www.nikoli.co.jp/en/puzzles/fillomino/</code></a>
</p>
<h2><a name="S29.1"></a>29.1 <a name="i2"></a>Filling-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Um Filling zu spielen, klicken Sie einfach mit der Maus in ein leeres Quadrat und tippen Sie eine Ziffer auf der Tastatur, um es zu f&#252;llen. Durch Ziehen mit der Maus k&#246;nnen sie mehrere Quadrate ausw&#228;hlen, um sie durch eine einzige Tastatureingabe zu f&#252;llen. Falls Sie einen Fehler machen, klicken Sie mit der Maus in das inkorrekte Quadrat und dr&#252;cken 0, die Leer-, R&#252;ckschritt- oder Eingabetaste, um das Feld wieder zu leeren (oder verwenden Sie die Undo-Funktion).
</p>
<p>
Sie k&#246;nnen sich im Gitter auch mit den Pfeiltasten bewegen. Durch Dr&#252;cken einer Ziffer wird das Quadrat unter dem Cursor mit der Zahl gef&#252;llt, durch Dr&#252;cken der 0, Leer-, R&#252;ckschritt- oder Eingabetaste wird es wieder bereinigt. Sie k&#246;nnen auch mehrere Quadrate zur Nummerierung oder Bereinigung ausw&#228;hlen, indem Sie vor der Eingabe der Ziffer in ein hervorgehobenes Quadrat die Eingabetaste dr&#252;cken (wie oben).
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S29.2"></a>29.2 <a name="i3"></a>Filling-Parameter</h2>
<p>
Bei Filling k&#246;nnen Sie die Anzahl der Zeilen und Spalten des Gitters mittels des &#8216;Type&#8217;-Men&#252;s einstellen.
</p>

<hr><address></address></body>
</html>
