<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Flip</title>
<link rel="previous" href="samegame.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="guess.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="samegame.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="guess.html">Next</a></p>
<h1><a name="C14"></a>Chapter 14: <a name="i0"></a>Flip</h1>
<p>
Sie verf&#252;gen &#252;ber ein Gitter von Quadraten, einige hell und andere dunkel. Ihr Ziel besteht darin, alle Quadrate gleichzeitig aufzuhellen. Sie k&#246;nnen jedes Quadrat ausw&#228;hlen und seinen Zustand von hell auf dunkel oder umgekehrt umschalten. Allerdings &#228;ndern dabei auch andere benachbarte Quadrate ihren Zustand.
</p>
<p>
Jedes Quadrat enth&#228;lt ein kleines Diagramm, das anzeigt, welche anderen Quadrate sich &#228;ndern, wenn Sie es umschalten.
</p>
<h2><a name="S14.1"></a>14.1 <a name="i1"></a>Flip-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Dieses Spiel kann entweder mit der Tastatur oder der Maus gespielt werden.
</p>
<p>
Linksklick in ein Quadrat dreht es und seine zugeh&#246;rigen Quadrate. Sie k&#246;nnen auch die Pfeiltasten verwenden, um ein Quadrat auszuw&#228;hlen und die Leer- oder Eingabetaste, um es umzudrehen.
</p>
<p>
Falls Sie die Funktion &#8216;Solve&#8217; in diesem Spiel benutzen, wird sie einige Quadrate rot markieren. Falls Sie einmal auf jedes Quadrat mit einer roten Markierung klicken, sollte das Spiel gel&#246;st sein. (Falls Sie auf ein Quadrat <em>ohne</em> eine rote Markierung klicken, wird darin eine rote Markierung erscheinen, um anzudeuten, dass Sie diese Operation zur&#252;cknehmen m&#252;ssen, um die L&#246;sung zu erreichen.)
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S14.2"></a>14.2 <a name="i2"></a>Flip-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>Shape type</em>
</dt>
<dd>
Diese Einstellung bestimmt die Form der Region, die durch Klicken in eines der zugeh&#246;rigen Quadrate gedreht wird. &#8216;Crosses&#8217; f&#252;hrt dazu, dass jedes Quadrat und seine vier direkten Nachbarn (oder drei oder zwei, falls es an einer Seite oder in einer Ecke ist) umgedreht werden. Die andere Einstellung, &#8216;Random&#8217;, f&#252;hrt dazu, dass eine zuf&#228;llige Region um jedes Quadrat gew&#228;hlt wird, so dass das Spiel jedes mal anders ist.
</dd>
</dl>

<hr><address></address></body>
</html>
