<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Flood</title>
<link rel="previous" href="unruly.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="tracks.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="unruly.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="tracks.html">Next</a></p>
<h1><a name="C39"></a>Chapter 39: <a name="i0"></a>Flood</h1>
<p>
Sie bekommen ein Gitter von Quadraten, zuf&#228;llig in mehreren Farben gef&#228;rbt. In jedem Spielzug k&#246;nnen Sie in einer Farbe Ihrer Wahl von der oberen linken Quadrat aus farben. Jeder Quadrat erreichbar vom Startplatz &#252;ber einen orthogonal verbunden Pfad der gleichfarbigen Quadrate wird in der neuen Farbe gef&#252;llt werden. Auf diese Weise wird mehr und mehr von dem Gitter auf das Startfeld verbunden.
</p>
<p>
Ihr Ziel ist, das gesamte Netz der gleichen Farbe in so wenig Spielz&#252;gen wie m&#246;glich zu machen. Das Spiel wird eine Obergrenze f&#252;r die Anzahl der Z&#252;ge setzen, basierend auf seiner eigenen internen L&#246;ser. Sie gewinnen, wenn Sie das gesamte Netz in der gleichen Farbe in so viele Z&#252;ge oder weniger machen.
</p>
<p>
Ich sah das Spiel (mit einem festen Gittergr&#246;&#223;e, feste Anzahl von Farben und festen Bewegungsweite) bei <a href="http://floodit.appspot.com"><code>floodit.appspot.com</code></a>.
</p>
<h2><a name="S39.1"></a>39.1 <a name="i1"></a>Flood-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Um Flood zu spielen, klicken Sie in einem Quadrat. Die obere linke Ecke und alles, was damit orthogonal verbunden ist, wird mit Flut gef&#252;llt mit der Farbe des Quadrats, den Sie angeklickt haben. Ein Klick auf einen Quadrat der gleichen Farbe wie die obere linke Ecke hat keine Wirkung, und daher z&#228;hlt nicht als Spielzug.
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um einen Positionsanzeiger &#252;ber das Gitter zu bewegen. Dr&#252;cken der Eingabetaste wird die obere linke Ecke mit Flut mit der Farbe der aktuellen Position f&#252;llen.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S39.2"></a>39.2 <a name="i2"></a>Flood-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters, in Quadraten.
</dd>
<dt>
<em>Colours</em>
</dt>
<dd>
Anzahl an verschiedenen Farben, die zum Auff&#252;llen des Gitters verwandt werden. Muss mindestens 3 and h&#246;chstens 10 sein. Bei 2 Farben g&#228;be es immer n&#252;r einen g&#252;ltigen Spielzug, und deswegen nie eine Wahl zu machen.
</dd>
<dt>
<em>Zus&#228;tzliche Spielz&#252;ge erlaubt.</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles, indem die Grenze f&#252;r die Anzahl der Spielz&#252;ge erh&#246;ht wird. In jedem neuen Gitter wird Flood eine interne L&#246;ser ausf&#252;hren, um eine eigene L&#246;sung zu erzeugen. Dann wird auf die L&#228;nge des L&#246;sung um Spielzugsgrenze des Spiels zu erzeugen der Wert in diesem Feld hinzugef&#252;gt. So ein Wert von 0 erfordert, dass Sie genauso effizient sein wie die automatische L&#246;ser und ein gr&#246;&#223;erer Wert macht es einfacher.
<p>
(Beachten Sie, dass der interne Solver nicht unbedingt den k&#252;rzesten m&#246;gliche L&#246;sung findet, aber ich glaube, es ist ziemlich nah dran. F&#252;r eine echte Herausforderung, setzen Sie diesen Wert auf 0 und dann versuchen, ein Gitter in streng weniger Spielz&#252;ge als der Grenzwert zu l&#246;sen!)
</p>

</dd>
</dl>

<hr><address></address></body>
</html>
