<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Galaxies</title>
<link rel="previous" href="unequal.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="filling.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="unequal.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="filling.html">Next</a></p>
<h1><a name="C28"></a>Chapter 28: <a name="i0"></a>Galaxies</h1>
<p>
Sie bekommen ein rechteckiges Gitter, das eine Anzahl von Punkten enth&#228;lt. Ihr Ziel besteht darin, Kanten entlang der Gitterlinien zu zeichnen, so dass das Gitter in Regionen eingeteilt wird, die 180&#176; rotationssymmetrisch sind und jeweils genau einen Punkt im Symmetriezentrum enthalten.
</p>
<p>
Dieses Puzzle wurde von <a name="i1"></a>Nikoli <a href="#p0">[13]</a> unter dem Namen &#8216;Tentai Show&#8217; erfunden; der Name wird normalerweise als &#8216;Spiral Galaxies&#8217; ins Englische &#252;bersetzt.
</p>
<p>
Galaxies wurde von James Harvey zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[13] <a href="http://www.nikoli.co.jp/en/puzzles/astronomical_show/"><code>http://www.nikoli.co.jp/en/puzzles/astronomical_show/</code></a>
</p>
<h2><a name="S28.1"></a>28.1 <a name="i2"></a>Galaxies-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Klicken Sie links auf jede Gitterlinie, um eine Kante zu zeichnen, falls noch keine vorhanden ist oder diese zu entfernen. Wenn Sie eine g&#252;ltige Region erstellt haben (d.h. die Region ist geschlossen, enth&#228;lt genau einen Punkt, ist um diesen 180&#176; symmetrisch und enth&#228;lt keine fehlerhaften Kanten) wird sie automatisch hervorgehoben; Ihr Ziel besteht darin, das gesamte Gitter auf diese Weise hervorgehoben zu bekommen.
</p>
<p>
Beim L&#246;sen k&#246;nnte es sein, dass Sie wissen, dass ein bestimmtes Gitterquadrat zu einem bestimmten Punkt geh&#246;rt, ohne dass Sie sich sicher sind, wo die Kanten liegen und welche anderen Quadrate mit dem Punkt verbunden sind. Um dies zu markieren (damit sie es nicht vergessen) k&#246;nnen Sie rechts auf den Punkt klicken und ziehen, womit eine Pfeilmarkierung, die auf den Punkt zeigt, erstellt wird. Lassen Sie diese in ein Quadrat Ihrer Wahl fallen und Sie werden daran erinnert, zu welchem Punkt es zugeordnet ist. Sie k&#246;nnen auf bestehende Pfeile auch rechtsklicken, um sie aufzunehmen und zu bewegen, oder sie durch Ziehen &#252;ber den Rand des Spielfeldes zu zerst&#246;ren. (Falls Sie sich nicht sicher sind, zu welchem Punkt ein Pfeil zeigt, k&#246;nnen Sie ihn auch aufnehmen und herumbewegen, um die klar zu stellen. Er wird sich st&#228;ndig drehen, w&#228;hrend Sie ihn ziehen, um weiterhin auf den Elternpunkt zu zeigen.
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um sich auf den Gitterquadraten und -linen zu bewegen. Durch Dr&#252;cken der Eingabetaste &#252;ber einer Gitterlinie wird wie oben eine Kante eingef&#252;gt oder entfernt. Durch Dr&#252;cken der Eingabetaste &#252;ber einem Punkt wird ein Pfeil aufgenommen, der dann beim n&#228;chsten Dr&#252;cken der Eingabetaste wieder abgelegt wird. Dies kann auch dazu verwandt werden, bestehende Pfeile herumzubewegen und sie durch Ablegen auf einen Punkt oder einen anderen Pfeil zu entfernen.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S28.2"></a>28.2 <a name="i3"></a>Galaxies-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles. Schwierigere Puzzle verlangen komplexere Schl&#252;sse und bei der Schwierigkeitsstufe &#8216;Unreasonable&#8217; k&#246;nnte R&#252;ckverfolgung notwendig sein.
</dd>
</dl>

<hr><address></address></body>
</html>
