<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Einleitung</title>
<link rel="previous" href="index.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="common.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="index.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="common.html">Next</a></p>
<h1><a name="C1"></a>Chapter 1: Einleitung</h1>
<p>
Ich habe diese Sammlung geschrieben, da ich glaubte, dass es mehr Desktop-Spielereien geben sollte: Kleine Spiele, die Sie in einem Fenster &#246;ffnen und f&#252;r zwei oder drei Minuten spielen k&#246;nnen, w&#228;hrend Sie eine Pause von Ihrer sonstigen T&#228;tigkeit machen. Und ich war auch ver&#228;rgert, dass jedes Mal, wenn ich ein gutes Spiel sagen wir unter <a name="i0"></a>Unix fand es nicht verf&#252;gbar war, wenn ich das n&#228;chste Mal an einer <a name="i1"></a>Windows-Maschine sa&#223; oder anders herum. Daher richtete ich es so ein, dass alles in meiner Puzzle-Sammlung problemlos auf beiden Plattformen laufen wird. K&#252;rzlich habe ich auch eine Portierung auf <a name="i2"></a>Mac OS X vorgenommen. Wenn ich weitere Puzzlespiele, die ich mag, finde (oder vielleicht erfinde), werden sie zu meiner Puzzle-Sammlung hinzugef&#252;gt und sofort auf beiden Plattformen verf&#252;gbar sein. Und falls jemand Lust hat, weitere Oberfl&#228;chen zu schreiben &#8211; PocketPC, Mac OS pre-10 oder was auch immer es sein mag &#8211; werden alle Spiele unter diesem Rahmenwerk sofort auf einer weiteren Plattform zur Verf&#252;gung stehen.
</p>
<p>
Die einzelnen Spiele in dieser Sammlung waren gr&#246;&#223;tenteils nicht meine Erfindung: Sie sind Neuimplementierungen von existierenden Spielkonzepten innerhalb meines portablen Puzzle-Rahmenwerks. Im Allgemeinen erhebe ich keine Urheberschaft f&#252;r die Erfindung der Regeln f&#252;r irgendwelche dieser Puzzle (und ich erhebe noch nicht mal die Autorenschaft f&#252;r den gesamten Code; einige der Puzzle wurden von anderen Autoren eingereicht).
</p>
<p>
Diese Sammlung wird unter der <a name="i3"></a>MIT-Lizenz (siehe <a href="licence.html#AA">appendix A</a>) vertrieben. Das bedeutet, dass Sie so ziemlich alles mit den ausf&#252;hrbaren Programmen oder dem Code der Spiele machen k&#246;nnen, au&#223;er zu behaupten, dass Sie sie selbst geschrieben haben oder mich zu verklagen, falls etwas schief geht.
</p>
<p>
Die neusten Versionen und der <a name="i4"></a>Quellcode kann unter <a name="i5"></a><a href="http://www.chiark.greenend.org.uk/~sgtatham/puzzles/"><code>http://www.chiark.greenend.org.uk/~sgtatham/puzzles/</code></a> gefunden werden.
</p>
<p>
Bitte berichten Sie <a name="i6"></a><a name="i7"></a>Fehler (auf Englisch) an <a href="mailto:anakin@pobox.com"><code>anakin@pobox.com</code></a>. Es k&#246;nnte hilfreich sein, dass Sie vor dem Melden des Fehler den folgenden Artikel lesen:
</p>
<p>
<a href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html"><code>http://www.chiark.greenend.org.uk/~sgtatham/bugs.html</code></a>
</p>
<p>
<a name="i8"></a>Patches sind willkommen. Insbesondere wenn Sie eine neue Oberfl&#228;che (um alle Spiele auf einer weiteren Plattform zum Laufen zu bekommen) oder ein neues Spiel bereitstellen.
</p>

<hr><address></address></body>
</html>
