<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Light Up</title>
<link rel="previous" href="slant.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="map.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="slant.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="map.html">Next</a></p>
<h1><a name="C21"></a>Chapter 21: <a name="i0"></a>Light Up</h1>
<p>
Sie haben ein Gitter von Quadraten. Einige sind schwarz ausgef&#252;llt, einige der schwarzen Quadrate sind nummeriert. Ihr Ziel besteht darin, alle leeren Quadrate zu &#8216;erleuchten&#8217;, indem Sie in einige davon Gl&#252;hbirnen platzieren.
</p>
<p>
Jede Gl&#252;hbirne erleuchtet das Quadrat, in dem es sich befindet, sowie alle Quadrate in einer Linie (sowohl horizontal als auch vertikal) soweit kein schwarzes Quadrat den Weg blockiert.
</p>
<p>
Um das Spiel zu gewinnen, m&#252;ssen folgende Bedingungen erf&#252;llt sein:
</p>
<ul><li>
Alle nicht schwarzen Quadrate m&#252;ssen erleuchtet sein.
</li>
<li>
Kein Licht wird von einem anderen Licht erleuchtet.
</li>
<li>
Jedes nummerierte schwarze Quadrat hat genau die angegebene Anzahl an Lichtern direkt daneben (in den vier Quadraten oberhalb, unterhalb und an den Seiten).
</li>
</ul>
<p>
Bei nicht nummerierten schwarzen Quadraten darf eine beliebige Anzahl von Lichtern in der direkten Nachbarschaft sein.
</p>
<p>
Dank f&#252;r dieses Puzzle geht an <a name="i1"></a>Nikoli <a href="#p0">[9]</a>.
</p>
<p>
Light Up wurde von James Harvey zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[9] <a href="http://www.nikoli.co.jp/puzzles/32/index-e.htm"><code>http://www.nikoli.co.jp/puzzles/32/index-e.htm</code></a> (Achtung Flash)
</p>
<h2><a name="S21.1"></a>21.1 <a name="i2"></a>Light Up-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Durch Linksklick in ein nicht schwarzes Quadrat schalten Sie die Anwesenheit eines Lichts an oder aus. Durch Rechtsklick auf ein nicht schwarzes Quadrat wird eine Markierung ein- oder ausgeschaltet, um Ihnen bei der L&#246;sung zu helfen; beispielsweise kann es Quadrate hervorheben, die nicht beleuchtet werden k&#246;nnen.
</p>
<p>
Sie d&#252;rfen weder ein Licht in ein markiertes Quadrat noch eine Markierung in ein beleuchtetes Quadrat setzten.
</p>
<p>
Das Spiel wird offensichtliche Fehler rot markieren. Lichter, die von anderen Lichtern erleuchtet werden, werden so hervorgehoben, genauso wie nummerierte Quadrate, die nicht die richtige Anzahl an Lichtern in der direkten Nachbarschaft haben (oder haben k&#246;nnen).
</p>
<p>
Daher ist das Gitter gel&#246;st, wenn alle nicht schwarzen Quadrate gelb hervorgehoben sind und es keine roten Lichter gibt.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S21.2"></a>21.2 <a name="i3"></a>Light Up-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>%age of black squares</em>
</dt>
<dd>
Grobe Prozentzahl an schwarzen Quadraten im Gitter.
<p>
Dies ist eher ein Hinweis als eine Anweisung. Falls die Gittererzeugung eines Puzzles mit der pr&#228;zisen Spezifikation nicht m&#246;glich ist, wird das Verh&#228;ltnis der schwarzen Quadrate solange erh&#246;ht, bis die Gittererzeugung gelingt.
</p>

</dd>
<dt>
<em>Symmetry</em>
</dt>
<dd>
Erlaubt Ihnen, die ben&#246;tigte Symmetrie der schwarzen Quadrate im Gitter anzugeben. (Dies beeinflusst die Schwierigkeit des Puzzles nicht merklich.)
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
&#8216;Easy&#8217; bedeutet, dass das Spiel ohne R&#252;ckverfolgungen oder Raten gel&#246;st werden kann, &#8216;Hard&#8217; bedeutet, dass Raten wahrscheinlich notwendig sein wird.
</dd>
</dl>

<hr><address></address></body>
</html>
