<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Magnets</title>
<link rel="previous" href="singles.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="signpost.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="singles.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="signpost.html">Next</a></p>
<h1><a name="C33"></a>Chapter 33: <a name="i0"></a>Magnets</h1>
<p>
Ein rechteckiges Gitter wurde mit einer Mischung von Magneten (d.h. Dominos mit einem positiven und einem negativen Ende) und leeren Dominos (d.h. Dominos mit zwei neutralen Polen) gef&#252;llt. Diese Dominos sind anfangs nur als Silhouette sichtbar. Um das Gitter herum werden eine Reihe von Hinweisen platziert, die die Anzahl an positiven und negativen Polen in bestimmten Zeilen und Spalten angeben.
</p>
<p>
Ihr Ziel besteht darin, unter Beachtung aller Hinweise die Magnete und leeren Dominos korrekt zu setzen. Weitere Randbedingung ist, dass zwei gleiche Magnetpole nicht gegen&#252;berliegend benachbart sein d&#252;rfen (da sie sich absto&#223;en). Neutrale Pole sto&#223;en sich nicht ab und k&#246;nnen neben jedem anderen Pol liegen.
</p>
<p>
Dank f&#252;r dieses Puzzle geht an <a name="i1"></a>Janko <a href="#p0">[16]</a>.
</p>
<p>
Magnets wurde von James Harvey zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[16] <a href="http://www.janko.at/Raetsel/Magnete/index.htm"><code>http://www.janko.at/Raetsel/Magnete/index.htm</code></a>
</p>
<h2><a name="S33.1"></a>33.1 <a name="i2"></a>Magnets-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Durch Linksklick auf ein leeres Quadrat wird ein Magnet auf dieser Position platziert, wobei der positive Pol auf dem Quadrat liegt und der negative auf der anderen H&#228;lfte des Magneten; durch erneuten Linksklick wird die Polarit&#228;t vertauscht. Ein dritter Linksklick entfernt den Magnet.
</p>
<p>
Rechtsklick auf ein leeres Quadrat platziert dort einen Domino. Ein erneuter Rechtsklick platziert dort zwei Fragezeichen, die signalisieren, dass &#8216;dies nicht leer sein kann&#8217; (das kann ein hilfreicher Hinweis w&#228;hrend des L&#246;sens sein) und ein weiterer Rechtsklick leert das Domino wieder.
</p>
<p>
Links-klicken auf einen Hinweis wird es durch graue Farbe als fertig markieren, oder die Markierung l&#246;sen, wenn es schon markiert ist.
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um den Cursor &#252;ber das Gitter zu bewegen. Durch Dr&#252;cken der Eingabetaste wird ein Domino mit einem positiven Pol an dieser Position abgelegt; durch erneutes Dr&#252;cken wird die Polarit&#228;t umgedreht und entfernt dann das Domino, wie beim Linksklick. Durch Dr&#252;cken der Eingabetaste wird, wie beim Rechtklick, ein leeres Domino platziert und das Feld als nicht leer/sicher belegt markiert.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S33.2"></a>33.2 <a name="i3"></a>Magnets-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten. Es gibt 0.5 &#215; <em>Width</em> &#215; <em>Height</em> Dominos pro Gitter: Falls diese Zahl ungerade ist, bleibt ein Quadrat leer.
<p>
(Gitter mit mindestens einer ungeraden Dimension sind tendenziell leichter zu l&#246;sen.)
</p>

</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles. Auf der Stufe &#187;Tricky&#171; m&#252;ssen Sie schwierigere Schlussfolgerungen &#252;ber leere Dominos und Anzahl von Spalten/Zeilen machen.
</dd>
<dt>
<em>Strip clues</em>
</dt>
<dd>
Falls wahr, werden zum Erstellzeitpunkt einige der Hinweise im Gitter entfernt, wodurch das Puzzle schwieriger wird.
</dd>
</dl>

<hr><address></address></body>
</html>
