<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Pattern</title>
<link rel="previous" href="netslide.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="solo.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="netslide.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="solo.html">Next</a></p>
<h1><a name="C10"></a>Chapter 10: <a name="i0"></a>Pattern</h1>
<p>
Sie bekommen ein Gitter von Quadraten, die alle entweder mit Wei&#223; oder mit Schwarz ausgef&#252;llt werden m&#252;ssen. Neben jeder Zeile des Gitters sind die L&#228;ngen der L&#228;ufe von schwarzen Quadraten in dieser Zeile angegeben, oberhalb jeder Spalte sind die L&#228;ngen der L&#228;ufe von schwarzen Quadraten in dieser Spalte angegeben. Ihr Ziel besteht darin, das gesamte Gitter schwarz oder wei&#223; einzuf&#228;rben.
</p>
<p>
Ich habe diese Art von Puzzle das erste Mal ungef&#228;hr 1995 gesehen, unter dem Namen &#8216;<a name="i1"></a>nonograms&#8217;. Seitdem habe ich es an verschiedenen Orten unter verschiedenen Namen gesehen.
</p>
<p>
Normalerweise ergeben Puzzle dieser Art ein Bild, das etwas bedeutet, wenn es gel&#246;st wurde. Da diese Version allerdings die Puzzle automatisch generiert, werden Sie wie zuf&#228;llig angeordnete Gruppierungen von Quadraten aussehen. (Ein Benutzer hat angedeutet, dass dies in der Tat eine <em>gute</em> Sache sei, da es Sie davon abh&#228;lt, aufgrund des Gesamtbildes die Farbe zu raten und Sie dazu zwingt, stattdessen die Logik anzuwenden). Der Vorteil besteht allerdings darin, dass Ihnen nie die Puzzle ausgehen.
</p>
<h2><a name="S10.1"></a>10.1 <a name="i2"></a>Pattern-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Dieses Spiel wird mit der Maus gespielt.
</p>
<p>
Ein Linksklick in ein Quadrat f&#228;rbt es schwarz. Ein Rechtsklick f&#228;rbt es wei&#223;. Falls Sie einen Fehler gemacht haben, k&#246;nnen Sie einen Mittelklick durchf&#252;hren oder die Umschalttaste gedr&#252;ckt halten, w&#228;hrend Sie mit einer beliebigen Taste klicken, um das Quadrat in das vorgegebene Grau zu f&#228;rben (was bedeutet, dass es wieder &#8216;unentschieden&#8217; ist).
</p>
<p>
Sie k&#246;nnen mit der linken oder rechten Maustaste klicken und ziehen, um eine vertikale oder horizontale Linie von Quadraten auf einmal schwarz oder respektive wei&#223; zu f&#228;rben. Falls Sie mit der mittleren Maustaste klicken und ziehen oder mit gedr&#252;ckt gehaltener Umschalttaste, k&#246;nnen Sie ein gesamtes Rechteck an Quadraten grau f&#228;rben.
</p>
<p>
Sie k&#246;nnen sich mit den Pfeiltasten &#252;ber das Gitter bewegen. Durch Dr&#252;cken der Eingabetaste wird die aktuelle Zelle nacheinander von leer zu schwarz zu wei&#223; wieder zu leer umgeschaltet; die Leertaste erm&#246;glicht dies in umgedrehter Reihenfolge.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S10.2"></a>10.2 <a name="i3"></a>Pattern-Parameter</h2>
<p>
Die einzigen unter der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbaren Optionen sind <em>Width</em> (Breite) und <em>Height</em> (H&#246;he), die selbsterkl&#228;rend sind.
</p>

<hr><address></address></body>
</html>
