<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Pegs</title>
<link rel="previous" href="guess.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="dominosa.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="guess.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="dominosa.html">Next</a></p>
<h1><a name="C16"></a>Chapter 16: <a name="i0"></a>Pegs</h1>
<p>
Eine Reihe von Stiften in in L&#246;chern auf einem Brett platziert. Sie k&#246;nnen einen Stift entfernen, indem Sie einen benachbarten Stift (horizontal oder vertikal) in ein leeres Loch auf der anderen Seite dar&#252;ber springen lassen Ihr Ziel besteht darin, alle bis auf einen der anf&#228;nglich verf&#252;gbaren Stifte zu entfernen.
</p>
<p>
Dieses Spiel, am besten als <a name="i1"></a>&#8216;Stifte-Solitaire&#8217; bekannt, ist m&#246;glicherweise eines der &#228;ltesten noch bekannten Puzzlespiele.
</p>
<h2><a name="S16.1"></a>16.1 <a name="i2"></a>Pegs-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Um einen Stift zu bewegen, ziehen Sie ihn mit der Maus von der aktuellen auf die endg&#252;ltige Position. Falls die endg&#252;ltige Position genau zwei L&#246;cher von der Anfangsposition entfernt ist, in ihr kein Stift ist und sich in dem dazwischen liegenden Quadrat ein Stift befindet, wird der Spielzug erlaubt und der dazwischenliegende Stift entfernt.
</p>
<p>
Leerr&#228;ume, in denen Sie einen Stift bewegen k&#246;nnen, werden mit L&#246;chern markiert. Ein Leerraum ohne Stift und ohne Loch ist nicht f&#252;r Spielz&#252;ge verf&#252;gbar: Es ist ein Hindernis, um das Sie sich herumarbeiten m&#252;ssen.
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um einen Positionsanzeiger &#252;ber das Brett zu bewegen. Wenn Sie die Eingabetaste gefolgt von einer Pfeiltaste dr&#252;cken, w&#228;hrend Sie sich &#252;ber einem Stift befinden, wird der Stift in die angegebene Richtung springen (falls das ein g&#252;ltiger Spielzug ist).
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S16.2"></a>16.2 <a name="i3"></a>Pegs-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in L&#246;chern.
</dd>
<dt>
<em>Board type</em>
</dt>
<dd>
Stellt ein, ob Sie ein Brett in der Standardform oder in einer zuf&#228;llig erstellten Form erhalten. Die derzeit unterst&#252;tzen Standardformen sind &#8216;Cross&#8217; (Kreuz) und &#8216;Octagon&#8217; (Oktaeder) (auch als englisches bzw europ&#228;isches Brettformat bekannt). Durch die Auswahl von &#8216;Random&#8217; (Zufall) erhalten Sie jedes Mal eine andere Brettform (aber immer eine, von der eine L&#246;sung bekannt ist).
</dd>
</dl>

<hr><address></address></body>
</html>
