<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Singles</title>
<link rel="previous" href="towers.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="magnets.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="towers.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="magnets.html">Next</a></p>
<h1><a name="C32"></a>Chapter 32: <a name="i0"></a>Singles</h1>
<p>
Sie bekommen ein Gitter aus wei&#223;en Quadraten, das alle Zahlen enth&#228;lt. Ihre Aufgabe besteht darin, einige davon schwarz zu f&#228;rben (und damit die Zahl zu entfernen), so dass die folgenden Bedingungen alle erf&#252;llt sind:
</p>
<ul><li>
Keine Zahl erscheint mehr als einmal in einer Spalte oder Zeile.
</li>
<li>
Kein schwarzes Quadrat ist horizontal oder vertikal zu einem anderen schwarzen Quadrat benachbart.
</li>
<li>
Die verbleibenden wei&#223;en Quadrate m&#252;ssen alle eine kontinuierliche Region bilden (verbunden &#252;ber Kanten, nicht nur Ber&#252;hrungen an Ecken).
</li>
</ul>
<p>
Dank f&#252;r dieses Puzzle geht an <a name="i1"></a>Nikoli <a href="#p0">[15]</a>, die es <a name="i2"></a>Hitori nannten.
</p>
<p>
Singles wurde von James Harvey zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[15] <a href="http://www.nikoli.com/en/puzzles/hitori/index.html"><code>http://www.nikoli.com/en/puzzles/hitori/index.html</code></a> (Achtung Flash)
</p>
<h2><a name="S32.1"></a>32.1 <a name="i3"></a>Singles-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Durch Linksklick auf ein leeres Quadrat wird es schwarz gef&#228;rbt; durch erneuten Linksklick wird die Zahl wieder angezeigt. Rechtsklick erg&#228;nzt einen Kreis (n&#252;tzlich um anzuzeigen, dass eine Zelle definitiv nicht schwarz ist).
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um sich auf dem Gitter zu bewegen. Durch Dr&#252;cken der Eingabe- oder Leertaste wird ein Quadrat schwarz gef&#228;rbt oder respektive ein Kreis hinzugef&#252;gt und durch erneutes Dr&#252;cken der Taste wird wieder die Zahl gezeigt oder der Kreis entfernt.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S32.2"></a>32.2 <a name="i4"></a>Singles-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles.
</dd>
</dl>

<hr><address></address></body>
</html>
