<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Sixteen</title>
<link rel="previous" href="fifteen.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="twiddle.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="fifteen.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="twiddle.html">Next</a></p>
<h1><a name="C6"></a>Chapter 6: <a name="i0"></a>Sixteen</h1>
<p>
Ein weiteres Puzzle mit verschiebbaren Platten, visuell sehr &#228;hnlich zu Fifteen (siehe<a href="fifteen.html#C5">chapter 5</a>)), aber mit einer anderen Art von Spielz&#252;gen. Diesmal gibt es kein Loch: Alle 16 Quadrate auf dem Gitter enthalten nummerierte Quadrate. Ihr Spielzug besteht darin, eine gesamte Zeile nach links oder rechts zu verschieben oder eine gesamte Spalte nach oben oder unten zu verschieben. Jedesmal, wenn Sie dies tun, erscheint die Platte, die Sie vom Gitter verschieben am anderen Ende der gleichen Zeile am Platz, den Sie gerade freigelegt haben. Um zu gewinnen, m&#252;ssen Sie die Platten in numerischer Reihenfolge anordnen (1,2,3,4 in der obersten Reihe und 13,14,15,16 in der untersten). Wenn Sie das erreicht haben, versuchen Sie auf einer anderen Gittergr&#246;&#223;e zu spielen.
</p>
<p>
Ich <em>k&#246;nnte</em> das Spiel selbst erfunden haben, allerdings dann nur versehentlich (und ich bin mir sicher, unabh&#228;ngig davon haben andere Leute es auch erfunden). Ich dachte, ich imitierte einen Bildschirmschoner, den ich gesehen hatte, aber ich denke, dass der Bildschirmschoner tats&#228;chlich ein Fifteen-artiges Puzzle statt dieses leicht verschiedene gewesen sein k&#246;nnte. Daher k&#246;nnte dies das einzige Ding in meiner Puzzle-Sammlung sein, das Kreativit&#228;t von meiner Seite statt reiner Umsetzungsarbeit zeigt.
</p>
<h2><a name="S6.1"></a>6.1 <a name="i1"></a>Sixteen-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Durch Linksklick auf einen Pfeil wird die zugeh&#246;rige Zeile oder Spalte in die angezeigte Richtung bewegt. Durch Rechtsklick wird sie in die entgegengesetzte Richtung bewegt.
</p>
<p>
Verwenden Sie alternativ die Pfeiltasten, um den Positionsanzeiger um den Rand des Gitters zu bewegen und verwenden Sie die Eingabetaste, um die Zeile/Spalte in die angegebene Richtung zu bewegen.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S6.2"></a>6.2 <a name="i2"></a>Sixteen-Parameter</h2>
<p>
Die von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbaren Parameter lauten:
</p>
<ul><li>
<em>Width</em> (Breite) und <em>Height</em> (H&#246;he) sind selbsterkl&#228;rend.
</li>
<li>
Sie k&#246;nnen darum bitten, dass auf dem Gitter nur eine begrenzte Vermischungs-Operation durchgef&#252;hrt wird. Standardm&#228;&#223;ig wird Sixteen das Gitter so vermischen, dass jede Anordnung gleich wahrscheinlich ist. Sie k&#246;nnen dieses Verhalten &#228;ndern, indem Sie eine genaue Anzahl an Vermischungsspielz&#252;ge angeben, die ausgef&#252;hrt werden sollen. Typischerweise besteht dann Ihr Ziel darin, die genaue Menge an Vermischungsspielz&#252;gen zu bestimmen und diese dann genau zu invertieren, so dass Sie beispielsweise eine vierz&#252;gige Vermischung mit einer vierz&#252;gigen L&#246;sung beantworten. Beachten Sie, dass bei einer gr&#246;&#223;eren Anzahl an Spielz&#252;gen die Wahrscheinlichkeit steigt, dass L&#246;sungen k&#252;rzer als die Zielanzahl m&#246;glich werden.
</li>
</ul>

<hr><address></address></body>
</html>
