<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Tents</title>
<link rel="previous" href="inertia.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="bridges.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="inertia.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="bridges.html">Next</a></p>
<h1><a name="C25"></a>Chapter 25: <a name="i0"></a>Tents</h1>
<p>
Sie bekommen ein Gitter aus Quadraten, von denen auf einigen B&#228;ume stehen. Ihr Ziel besteht darin, auf einige der verbliebenen Quadrate Zelte aufzustellen, so dass die folgenden Bedingungen erf&#252;llt sind:
</p>
<ul><li>
Es gibt genausoviele Zelte wie B&#228;ume.
</li>
<li>
Die Zelte und B&#228;ume k&#246;nnen so zugeordnet werden, dass sich jedes Zelt (horizontal oder vertikal, aber nicht diagonal) neben seinem Baum befindet. Ein Zelt darf sich aber auch neben anderen als dem eigenen Baum befinden.
</li>
<li>
Keine zwei Zelte befinden sich horizontal, vertikal <em>oder diagonal</em> nebeneinander.
</li>
<li>
Die Anzahl der Zelte in jeder Zeile und in jeder Spalte passt zu der Zahl, die am Rande des Gitters angegeben ist.
</li>
</ul>
<p>
Dieses Puzzle kann an verschiedenen Stellen im Internet gefunden werden und ich wurde per E-Mail darauf aufmerksam gemacht. Ich wei&#223; nicht, wem ich f&#252;r die Erfindung meinen Dank aussprechen soll.
</p>
<h2><a name="S25.1"></a>25.1 <a name="i1"></a>Tents-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Durch Linksklick in ein leeres Quadrat wird dort ein Zelt positioniert. Durch Rechtsklick in ein leeres Quadrat wird dieses gr&#252;n eingef&#228;rbt, um anzudeuten, dass Sie sich sicher sind, dass hier <em>kein</em> Zelt ist. Durch Klicken eines beliebigen Knopfes auf ein nicht leeres Quadrat wird dies bereinigt.
</p>
<p>
Falls Sie mit dem rechten Knopf entlang einer Zeile oder Spalte <em>ziehen</em>, wird jedes leere Quadrat in der &#252;berstrichenen Region gr&#252;n gef&#228;rbt und alle anderen Quadrate bleiben unver&#228;ndert. (Dies ist n&#252;tzlich, wenn Sie den Rest einer Zeile bereinigen wollen, nachdem Sie alle Zelte gesetzt haben.)
</p>
<p>
Sie k&#246;nnen auch die Pfeiltasten verwenden, um sich im Gitter zu bewegen. Durch Dr&#252;cken der Eingabetaste auf einem leeren Feld wird dort ein Zelt positioniert und durch Dr&#252;cken der Leertaste auf einem leeren Feld wird dies gr&#252;n eingef&#228;rbt; jede der beiden Tasten wird ein besetztes Quadrat bereinigen.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S25.2"></a>25.2 <a name="i2"></a>Tents-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit der generierten Puzzles. Schwerere Puzzle ben&#246;tigen komplexere Herleitungen, aber derzeit sollte keine der Schwierigkeitsstufen Raten und R&#252;ckverfolgung ben&#246;tigen.
</dd>
</dl>

<hr><address></address></body>
</html>
