<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Towers</title>
<link rel="previous" href="keen.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="singles.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="keen.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="singles.html">Next</a></p>
<h1><a name="C31"></a>Chapter 31: <a name="i0"></a>Towers</h1>
<p>
Sie bekommen ein Quadratgitter. In jedem Quadrat des Gitters k&#246;nnen Sie einen Turm bauen, wobei die H&#246;he von 1 bis zu der Gittergr&#246;&#223;e variiert. Um den Rand des Gitters herum befinden sich ein paar nummerische Hinweise.
</p>
<p>
Ihre Aufgabe besteht darin, in jedem Quadrat einen Turm zu bauen, so dass
</p>
<ul><li>
jede Zeile jede m&#246;gliche H&#246;he eines Turms einmal enth&#228;lt
</li>
<li>
jede Spalte jede m&#246;gliche H&#246;he eines Turms einmal enth&#228;lt
</li>
<li>
jeder numerische Hinweis die Anzahl der T&#252;rme beschreibt, die gesehen werden, wenn das Quadrat von dieser Seite aus betrachtet wird, wobei angenommen wird, dass niedriegere T&#252;rme hinter gr&#246;&#223;eren T&#252;rmen versteckt sind. In einem 5&#215;5-Gitter bedeutet ein Hinweis &#8216;5&#8217;, dass die f&#252;nf T&#252;rme in ansteigender Gr&#246;&#223;e auftauchen m&#252;ssen (andernfalls k&#246;nnten nicht alle f&#252;nf T&#252;rme gesehen werden), w&#228;hrend ein Hinweis &#8216;1&#8217; anzeigt, dass der h&#246;chste Turm (der mit 5 markiert ist) als erstes kommen muss.
</li>
</ul>
<p>
In schwierigeren oder gr&#246;&#223;eren Puzzlen werden neben den Hinweisen an den Seiten auch einige T&#252;rme spezifiziert und einige Hinweise an den R&#228;ndern k&#246;nnten fehlen.
</p>
<p>
Das Puzzle erscheint im Web unter verschiedenen Namen, insbesondere &#8216;<a name="i1"></a>Skyscrapers&#8217;, aber ich wei&#223; nicht, wer es erfunden hat.
</p>
<h2><a name="S31.1"></a>31.1 <a name="i2"></a>Towers-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Towers hat viel mit dem Steuersystem von Solo, Unequal und Keen gemeinsam.
</p>
<p>
Um Towers zu spielen, klicken Sie einfach mit der Maus in ein leeres Quadrat und tippen Sie dann eine Ziffer auf der Tastatur, um dieses Quadrat mit einem Turm dieser H&#246;he zu f&#252;llen. Falls Sie einen Fehler gemacht haben, klicken Sie mit der Maus in das fehlerhafte Quadrat und dr&#252;cken Sie die Leertaste, um es wieder zu leeren (oder verwenden Sie die Undo-Funktion).
</p>
<p>
Falls Sie in ein Quadrat <em>rechts-</em>klicken und dann eine Zahl tippen, wird diese Zahl im Quadrat als &#8216;Bleistiftmarkierung&#8217; eingetragen. Sie k&#246;nnen Bleistiftmarkierungen f&#252;r mehrere Zahlen im gleichen Quadrat vornehmen. Quadrate, in denen sich ein Turm befindet k&#246;nnen nicht auch gleichzeitig &#252;ber Bleistiftmarkierungen verf&#252;gen.
</p>
<p>
Das Spiel ignoriert Bleistiftmarkierungen, daher k&#246;nnen Sie diese so einsetzen, wie Sie m&#246;chten: Sie k&#246;nnen Sie als Erinnerung verwenden, dass ein bestimmtes Quadrat noch mal untersucht werden muss, sobald Sie mehr &#252;ber eine bestimmte Zahl wissen, oder Sie k&#246;nnen sie als Liste m&#246;glicher Zahlen f&#252;r ein gegebenes Quadrat verwenden oder irgendetwas anderes, was Sie m&#246;gen.
</p>
<p>
Um eine einzelne Bleistiftmarkierung zu entfernen, klicken Sie rechts in das Quadrat und tippen Sie die Zahl noch mal.
</p>
<p>
Alle Bleistiftmarkierungen in einem Quadrat werden gel&#246;scht, wenn Sie linksklicken und eine Zahl eingeben oder wenn Sie linksklicken und die Leertaste dr&#252;cken. Auch rechtsklicken und dr&#252;cken der Leertaste wird die Bleistiftmarkierungen l&#246;schen.
</p>
<p>
Wie bei Solo k&#246;nnen die Pfeiltasten zusammen mit den Zifferntasten verwendet werden, um Nummern oder Bleistiftmarkierungen zu setzen. Verwenden Sie die Pfeiltasten, um eine Hervorhebung &#252;ber das Gitter zu bewegen und geben Sie eine Ziffer in das hervorgehobene Quadrat ein. Durch Dr&#252;cken der Eingabetaste schalten Sie in einen Modus um, in dem Sie statt der Hervorhebung Bleistiftmarkierungen eingeben oder entfernen k&#246;nnen.
</p>
<p>
Durch Dr&#252;cken von &#187;M&#171; wird ein kompletter Satz an Bleistiftmarkierungen in jedes Quadrat, das noch keine Hauptziffer enth&#228;lt, eingef&#252;gt.
</p>
<p>
Links-klicken auf einen Hinweis wird es durch graue Farbe als fertig markieren, oder die Markierung l&#246;sen, wenn es schon markiert ist.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S31.2"></a>31.2 <a name="i3"></a>Towers-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Grid size</em>
</dt>
<dd>
Legt die Gr&#246;&#223;e des Gitters fest. Die untere Grenze ist 3; die obere Grenze ist 9 (da die Benutzerschnittstelle mit &#8216;Ziffern&#8217; gr&#246;&#223;er als 9 schwerer w&#252;rde!).
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles. In der Stufe &#187;Unreasonable&#171; wird R&#252;ckverfolgung ben&#246;tigt, die L&#246;sung sollte aber immer noch eindeutig sein. Die Stufen dazwischen ben&#246;tigen zunehmend komplexe Schlussfolgerungen, um R&#252;ckverfolgung zu vermeiden.
</dd>
</dl>

<hr><address></address></body>
</html>
