<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Tracks</title>
<link rel="previous" href="flood.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="palisade.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="flood.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="palisade.html">Next</a></p>
<h1><a name="C40"></a>Chapter 40: <a name="i0"></a>Tracks</h1>
<p>
Sie erhalten ein Gitter von Quadraten von denen einige mit Gleisen von Z&#252;gen gef&#252;llt sind. Sie m&#252;ssen die Gleise von A nach B so vervollst&#228;ndigen, dass die Zeilen und Spalten die gleiche Anzahl von Gleissegmenten enthalten, wie dies in den Hilfestellungen oben und rechts vom Gitter angegeben ist.
</p>
<p>
Es gibt nur gerade und 90&#176; gebogene Schienen und die Gleise d&#252;rfen sich nicht selbst kreuzen.
</p>
<p>
Tracks ist ein Beitrag von James Harvey zu dieser Sammlung.
</p>
<h2><a name="S40.1"></a>40.1 <a name="i1"></a>Tracks-Steuerungen</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden (Strg und Umschalt sind nicht verf&#252;gbar). Es gibt auch ein optionaler Nacht-Modus, in dem dunklere Farben verwendet werden.</em>
</p>
<p>
Durch Linksklick auf eine Kante zwischen zwei Quadraten wird ein Gleissgement zwischen den zwei Quadraten hinzugef&#252;gt. Durch Rechtsklick wird ein Kreuz auf der Kante hinzugef&#252;gt, das anzeigt, dass hier kein Gleis m&#246;glich ist.
</p>
<p>
Durch Linksklick auf ein Quadrat wird eine Farbanzeige hinzugef&#252;gt, die zeigt, dass Sie wissen, dass das Quadrat ein Gleis enthalten muss, selbst wenn Sie noch nicht wissen, &#252;ber welche Kante es l&#228;uft. Durch Rechtsklick in ein Quadrat wird ein Kreuz hinzugef&#252;gt, das angibt, dass es kein Gleissgement enth&#228;lt.
</p>
<p>
Links- oder Rechts-Ziehen zwischen Quadraten erlaubt es Ihnen, eine gerade Linie von Schienen-existieren- oder Schienen-existieren-nicht-Anzeigen zu legen. Dies ist n&#252;tzlich, um Zeilen oder Spalten auf den Hinweis anzupassen.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S40.2"></a>40.2 <a name="i2"></a>Tracks-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters, in Quadraten.
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles: bei der Stufe &#187;Tricky&#171; m&#252;ssen Sie schwierigere Schlussfolgerungen in Bezug auf Z&#252;ge machen, die sp&#228;ter zu unm&#246;glichen Kreuzungen f&#252;hren k&#246;nnten.
</dd>
<dt>
<em>Disallow consecutive 1 clues</em>
</dt>
<dd>
Steuert, ob es die Spielerzeugung von Tracks zwei benachbarten Zeilen oder Spalten erlaubt, genau einen Hinweis zu haben oder es der Zeile oder Spalte der Endpunkte der Gleise erlaubt, genau einen Hinweis zu tragen. Standardm&#228;&#223;ig ist dies nicht erlaubt, um lange gerade und langweilige Gleissegmente zu vermeiden und das Spiel fummeliger und interessanter zu gestalten. Falls Sie diese M&#246;glichkeit wieder erlauben wollen, schalten Sie diese Option aus.
</dd>
</dl>

<hr><address></address></body>
</html>
