<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=US-ASCII">
<title>Undead</title>
<link rel="previous" href="pearl.html">
<link rel="ToC" href="index.html">
<link rel="up" href="index.html">
<link rel="index" href="docindex.html">
<link rel="next" href="unruly.html">
<style type="text/css">body { word-wrap: break-word; } body.night { color: #dddddd; background: #000000; } body.night a:link { color: #8888ff; } body.night a:visited { color: #cc88ff; }</style></head>
<body>
<p><a href="pearl.html">Previous</a> | <a href="index.html">Contents</a> | <a href="docindex.html">Index</a> | <a href="unruly.html">Next</a></p>
<h1><a name="C37"></a>Chapter 37: <a name="i0"></a>Undead</h1>
<p>
Sie bekommen ein Gitter von Quadraten, von denen einige diagonale Spiegel enthalten. Jedes Quadrat, das kein Spielgel ist, muss mit einem von drei Arten von untoten Monstern gef&#252;llt werden: einem Geist, einem Vampir oder einem Zombie.
</p>
<p>
Vampire k&#246;nnen direkt gesehen werden, sind aber beim Spiegeln im Spiegel unsichtbar. Bei Geistern ist es genau andersherum: sie k&#246;nnen in Spiegeln gesehen werden, aber sind beim direkten Anschauen unsichtbar. Zombies sind auf beide Arten sichtbar.
</p>
<p>
Ihnen wird auch die Gesamtanzahl von jeder Art von Monster im Gitter mitgeteilt. Auch entlang der Ecken des Gitters sind Zahlen geschrieben, die angeben, wie viele Monster gesehen werden k&#246;nnen, falls Sie in das Gitter entlang einer Spalte oder Zeile, beginnend von dieser Position, schauen. (Die diagonalen Spiegel reflektieren nach beiden Seiten. Falls Ihre reflektierte Sichtlinie das selbe Monster mehr als einmal kreuzt, wird es in der Zahl jedes Mal gez&#228;hlt, wenn es sichtbar ist, nicht nur einmal.)
</p>
<p>
Dieses Puzzle wurde von David Millar unter dem Namen &#8216;Haunted Mirror Maze&#8217; erfunden. Siehe <a href="#p0">[20]</a> f&#252;r weitere Details.
</p>
<p>
Unruly wurde von Steffen Bauer zu dieser Sammlung beigesteuert.
</p>
<p><a name="p0"></a>
[20] <a href="http://www.janko.at/Raetsel/Spukschloss/index.htm"><code>http://www.janko.at/Raetsel/Spukschloss/index.htm</code></a>
</p>
<h2><a name="S37.1"></a>37.1 <a name="i1"></a>Undead-Steuerung</h2>
<p>
<em>Unter Android muss man dr&#252;cken statt links klicken und langes dr&#252;cken statt rechts klicken. Wo dieses Handbuch Buchstaben auf der Tastatur erw&#228;hnt, k&#246;nnen diese als Bildzeichen am Fu&#223; des Bildschirms gefunden werden.</em>
</p>
<p>
Undead hat ein &#228;hnliches Steuersystem wie Solo, Unequal und Keen.
</p>
<p>
Um Undead zu spielen, klicken Sie mit der Maus in ein leeres Quadrat und geben dann auf der Tastatur einen Buchstaben ein, der die Art des Monsters anzeigt: &#8216;G&#8217; f&#252;r einen Geist, &#8216;V&#8217; f&#252;r einen Vampir oder &#8216;Z&#8217; f&#252;r einen Zombie. Falls Sie einen Fehler machen, klicken Sie mit der Maus in das fehlerhafte Quadrat und dr&#252;cken die Leertaste, um das Quadrat wieder zu bereinigen (oder verwenden Sie die Funktion &#187;Undo&#171;).
</p>
<p>
Falls Sie <em>rechts</em> in ein Quadrat klicken und dann einen Buchstaben eingeben, wird das entsprechende Monster als &#8216;Bleistiftmarkierung&#8217; in einer reduzierten Gr&#246;&#223;e in diesem Quadrat angezeigt. Sie k&#246;nnen Bleistiftmarkierungen f&#252;r mehrere Monster im gleichen Quadrat vornehmen. Ein Quadrat, das ein komplettes Monster enth&#228;lt, kann nicht gleichzeitig auch Bleistiftmarkierungen enthalten.
</p>
<p>
Das Spiel ber&#252;cksichtigt Bleistiftmarkierungen &#252;berhaupt nicht. Daher steht Ihnen frei, sie beliebig zu verwenden: Sie k&#246;nnen Sie als Erinnerungsst&#252;tze verwenden, dass ein Quadrat noch einmal genau untersucht werden muss, wenn Sie mehr &#252;ber ein bestimmtes Monster wissen, oder Sie k&#246;nnen Sie als Liste m&#246;glicher Monster in einem bestimmten Quadrat verwenden, oder f&#252;r etwas anderes nach Ihrer Wahl.
</p>
<p>
Um eine Bleistiftmarkierung zu l&#246;schen, klicken Sie rechts in ein Quadrat und geben den gleichen Buchstaben erneut ein.
</p>
<p>
Alle Bleistiftmarkierungen in einem Quadrat werden gel&#246;scht, wenn Sie linksklicken und einen Monsterbuchstaben eingeben oder wenn Sie linksklicken und die Leertaste dr&#252;cken. Auch Rechtsklicken und Dr&#252;cken der Leertaste wird die Bleistiftmarkierungen l&#246;schen.
</p>
<p>
Wie bei Solo k&#246;nnen die Pfeiltasten zusammen mit den Buchstabentasten verwendet werden, um Monster oder Bleistiftmarkierungen zu setzen. Verwenden Sie die Pfeiltasten, um eine Hervorhebung &#252;ber das Gitter zu bewegen und geben Sie einen Monsterbuchstaben in das hervorgehobene Quadrat ein. Durch Dr&#252;cken der Eingabetaste schalten Sie in einen Modus um, in dem Sie statt der Hervorhebung Bleistiftmarkierungen eingeben oder entfernen k&#246;nnen.
</p>
<p>
Falls Sie einfache Buchstaben des Alphabets gegen&#252;ber netten Monsterbildern bevorzugen, k&#246;nnen Sie &#8216;A&#8217; eingeben, um zwischen der Anzeige der Monster als Monster und der Anzeige als Buchstaben umzuschalten.
</p>
<p>
Links-klicken auf einen Hinweis wird es durch graue Farbe als fertig markieren, oder die Markierung l&#246;sen, wenn es schon markiert ist.
</p>
<p>
(Alle in <a href="common.html#S2.1">section 2.1</a> beschriebene Aktionen sind auch verf&#252;gbar.)
</p>
<h2><a name="S37.2"></a>37.2 <a name="i2"></a>Undead-Parameter</h2>
<p>
Diese Parameter sind von der Option &#8216;Custom...&#8217; im Men&#252; &#8216;Type&#8217; verf&#252;gbar.
</p>
<dl><dt>
<em>Width</em> (Breite), <em>Height</em> (H&#246;he)
</dt>
<dd>
Gr&#246;&#223;e des Gitters in Quadraten
</dd>
<dt>
<em>Difficulty</em>
</dt>
<dd>
Steuert die Schwierigkeit des erstellten Puzzles.
</dd>
</dl>

<hr><address></address></body>
</html>
